Tekla Open API Reference for Tekla Structures 2025
AnalysisAreaPolygon Constructor
 Creates a new instance of the AnalysisAreaPolygon class.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisAreaPolygon(
	AnalysisObject.AnalysisObjectEnum ObjectType
)
Public Sub New (
	ObjectType As AnalysisObject.AnalysisObjectEnum
)
Parameters
ObjectType
Type: Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum
The type of the analysis object.
See Also
Reference
AnalysisAreaPolygon Class
Tekla.Structures.Analysis Namespace